library/utf8/tests/data/bench/strpos_mbstring_20060226.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.54
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/strpos.php?engine=mbstring
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   4.664597 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      319000 bytes
HTML transferred:       95000 bytes
Requests per second:    214.38 [#/sec] (mean)
Time per request:       4.665 [ms] (mean)
Time per request:       4.665 [ms] (mean, across all concurrent requests)
Transfer rate:          66.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    4   3.1      2      33
Waiting:        0    0   0.3      0       8
Total:          2    4   3.1      2      33

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      6
  75%      6
  80%      7
  90%      7
  95%      7
  98%      7
  99%      9
 100%     33 (longest request)