library/utf8/tests/data/bench/strpos_native_20061001.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.55
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/strpos.php?engine=native
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   9.257604 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      297000 bytes
HTML transferred:       95000 bytes
Requests per second:    108.02 [#/sec] (mean)
Time per request:       9.258 [ms] (mean)
Time per request:       9.258 [ms] (mean, across all concurrent requests)
Transfer rate:          31.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     7    8   2.8      8      44
Waiting:        0    8   3.3      8      43
Total:          7    8   2.8      8      44

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      9
  90%     10
  95%     11
  98%     17
  99%     24
 100%     44 (longest request)