library/utf8/tests/data/bench/strrpos_mbstring_20061001.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.55
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/strrpos.php?engine=mbstring
Document Length:        156 bytes

Concurrency Level:      1
Time taken for tests:   32.406529 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      359000 bytes
HTML transferred:       156000 bytes
Requests per second:    30.86 [#/sec] (mean)
Time per request:       32.407 [ms] (mean)
Time per request:       32.407 [ms] (mean, across all concurrent requests)
Transfer rate:          10.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    26   31  16.9     28     140
Waiting:        0   31  16.9     28     140
Total:         26   31  16.9     28     140

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     28
  75%     29
  80%     29
  90%     32
  95%     55
  98%    103
  99%    112
 100%    140 (longest request)