library/utf8/tests/data/bench/substr_mbstring_20061001.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.55
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/substr.php?engine=mbstring
Document Length:        5 bytes

Concurrency Level:      1
Time taken for tests:   16.417722 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      206000 bytes
HTML transferred:       5000 bytes
Requests per second:    60.91 [#/sec] (mean)
Time per request:       16.418 [ms] (mean)
Time per request:       16.418 [ms] (mean, across all concurrent requests)
Transfer rate:          12.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    14   15   3.4     16      55
Waiting:        0   15   3.8     16      55
Total:         14   15   3.4     16      55

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     16
  80%     17
  90%     17
  95%     18
  98%     23
  99%     35
 100%     55 (longest request)